src/test/testtool/subscription-management-and-processing/callbacksender/01/callbackInput.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLk01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310"
            xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
            xmlns:a="http://www.egem.nl/StUF/StUF0301"
            xmlns:gml="http://www.opengis.net/gml"
            xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310"
            xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <BG:stuurgegevens>
      <StUF:berichtcode>Lk01</StUF:berichtcode>
      <StUF:zender>
         <StUF:organisatie>NEDGR</StUF:organisatie>
         <StUF:applicatie>NEDMAG_OPT</StUF:applicatie>
      </StUF:zender>
      <StUF:ontvanger>
         <StUF:organisatie>1234</StUF:organisatie>
         <StUF:applicatie>LBA</StUF:applicatie>
         <StUF:administratie/>
         <StUF:gebruiker/>
      </StUF:ontvanger>
      <StUF:referentienummer>da4bbc30-6705-4734-8c90-4ec76a36905e</StUF:referentienummer>
      <StUF:tijdstipBericht>20250708100709</StUF:tijdstipBericht>
      <StUF:entiteittype>NPS</StUF:entiteittype>
   </BG:stuurgegevens>
   <BG:parameters>
      <StUF:mutatiesoort>T</StUF:mutatiesoort>
      <StUF:indicatorOvername>V</StUF:indicatorOvername>
   </BG:parameters>
   <BG:object StUF:entiteittype="NPS"
              StUF:verwerkingssoort="T"
              StUF:sleutelVerzendend="529148a9a8f563968aeebd4aa8c48aef41a70fac"
              StUF:sleutelOntvangend="LBA.00000142157">
      <BG:inp.bsn xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.a-nummer>3959725474</BG:inp.a-nummer>
      <BG:geslachtsnaam>Verhuistest</BG:geslachtsnaam>
      <BG:voorvoegselGeslachtsnaam>van den</BG:voorvoegselGeslachtsnaam>
      <BG:voorletters>K.</BG:voorletters>
      <BG:voornamen>Kees</BG:voornamen>
      <BG:aanduidingNaamgebruik>E</BG:aanduidingNaamgebruik>
      <BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
      <BG:geboortedatum>20020701</BG:geboortedatum>
      <BG:inp.geboorteplaats>Hellevoetsluis</BG:inp.geboorteplaats>
      <BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
      <BG:overlijdensdatum xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.overlijdenplaats xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.overlijdenLand xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.verblijftIn StUF:entiteittype="NPSTGO">
         <BG:gerelateerde StUF:entiteittype="TGO">
            <BG:adresAanduidingGrp>
               <BG:num.identificatie>0518200000466194</BG:num.identificatie>
               <BG:wpl.woonplaatsNaam>'s-Gravenhage</BG:wpl.woonplaatsNaam>
               <BG:gor.openbareRuimteNaam>Laan van Nieuw-Oost-Indië</BG:gor.openbareRuimteNaam>
               <BG:aoa.postcode>2593BL</BG:aoa.postcode>
               <BG:aoa.huisnummer>101</BG:aoa.huisnummer>
               <BG:aoa.huisletter>A</BG:aoa.huisletter>
               <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="geenWaarde"/>
               <BG:ogo.locatieAanduiding xsi:nil="true" StUF:noValue="geenWaarde"/>
            </BG:adresAanduidingGrp>
         </BG:gerelateerde>
      </BG:inp.verblijftIn>
      <BG:verblijfsadres>
         <BG:aoa.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
         <BG:wpl.woonplaatsNaam>'s-Gravenhage</BG:wpl.woonplaatsNaam>
         <BG:aoa.woonplaatsWaarinGelegen>
            <BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
            <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
         </BG:aoa.woonplaatsWaarinGelegen>
         <BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
         <BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
         <BG:gor.openbareRuimteNaam>Laan van Nieuw-Oost-Indië</BG:gor.openbareRuimteNaam>
         <BG:gor.straatnaam>Laan van Nieuw-O-Indië</BG:gor.straatnaam>
         <BG:aoa.postcode>2593BL</BG:aoa.postcode>
         <BG:aoa.huisnummer>101</BG:aoa.huisnummer>
         <BG:aoa.huisletter>A</BG:aoa.huisletter>
         <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="geenWaarde"/>
         <BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="geenWaarde"/>
         <BG:begindatumVerblijf>20250612</BG:begindatumVerblijf>
      </BG:verblijfsadres>
      <BG:inp.adresHerkomst>W</BG:inp.adresHerkomst>
      <BG:sub.correspondentieAdres>
         <BG:authentiek xsi:nil="true" StUF:noValue="geenWaarde"/>
      </BG:sub.correspondentieAdres>
      <BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:inp.gemeenteVanInschrijving>0518</BG:inp.gemeenteVanInschrijving>
      <BG:inp.datumInschrijving>20060318</BG:inp.datumInschrijving>
      <BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:ing.datumVerkrijgingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:ing.datumVerliesVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.emigratieLand xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:ing.aanduidingEuropeesKiesrecht xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      <BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:ing.indicatieCurateleRegister xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.datumOpschortingBijhouding xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.redenOpschortingBijhouding xsi:nil="true" StUF:noValue="geenWaarde"/>
      <BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
      <BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
         <BG:gerelateerde StUF:entiteittype="NPS">
            <BG:inp.bsn xsi:nil="true" StUF:noValue="geenWaarde"/>
            <BG:geslachtsnaam>Verhuistest</BG:geslachtsnaam>
            <BG:voorvoegselGeslachtsnaam>van den</BG:voorvoegselGeslachtsnaam>
            <BG:voorletters>C.</BG:voorletters>
            <BG:voornamen>Carolina</BG:voornamen>
            <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
            <BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
            <BG:geboortedatum>19710823</BG:geboortedatum>
            <BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
            <BG:inp.geboorteLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
            <BG:sub.verblijfBuitenland/>
         </BG:gerelateerde>
         <BG:ouderAanduiding>Ouder1</BG:ouderAanduiding>
         <BG:datumIngangFamilierechtelijkeBetrekking xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
      </BG:inp.heeftAlsOuders>
      <BG:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT">
         <BG:gerelateerde StUF:entiteittype="NAT">
            <BG:code>1</BG:code>
         </BG:gerelateerde>
         <BG:inp.redenVerkrijging>017</BG:inp.redenVerkrijging>
         <BG:inp.datumVerkrijging>20020701</BG:inp.datumVerkrijging>
      </BG:inp.heeftAlsNationaliteit>
   </BG:object>
</BG:npsLk01>
</soapenv:Body></soapenv:Envelope>